jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
/*
 * Per-channel mutable state. Lives in .bss (zero-initialized). Only
 * the fields we need in the IRQ dispatch hot path are kept; the rest
 * of the rulos_dma_config_t passed to rulos_dma_alloc() is written
 * to DMA hardware registers by init_channel() and then discarded.
 *
 * Opaque API handle: rulos_dma_channel_t* is a cast pointer into this
 * array. The array index (and therefore the matching g_hw entry) is
 * recovered by pointer subtraction.
 */
typedef struct {
  bool allocated;
  void (*tc_callback)(void *user_data);
  void (*ht_callback)(void *user_data);
  void (*error_callback)(void *user_data);
  void *user_data;
} dma_channel_state_t;

static dma_channel_state_t g_state[DMA_CHANNEL_SLOTS];

// Convert an opaque handle back to its slot index.
static inline int state_to_idx(const rulos_dma_channel_t *ch) {
  return (const dma_channel_state_t *)ch - g_state;
}

#if !RULOS_DMA_HAS_DMAMUX
/*
 * Fixed-map families (F0/F1/F3) wire each DMA-capable peripheral to a
 * specific hardware channel at manufacturing time (see the chip RM's
 * DMA request mapping table). There's no dynamic routing -- if two
 * peripherals happen to share a channel, they can't coexist.
 *
 * Values are stored as `slot_index + 1` so that an unset entry
 * (left at zero by designated initializers) unambiguously means
 * "this request has no fixed mapping on this chip". Lookup subtracts
 * one to recover the real slot index.
 *
 * Sourced from the DMA request-to-channel tables in the vendor
 * reference manuals:
 *   F0: RM0360 Table 33 ("DMA1 requests for each channel")
 *   F1: RM0008 Table 78 ("Summary of DMA1 requests for each channel")
 *   F3: RM0316 Table 29 ("Summary of the DMA1 requests for each channel")
 */
static const uint8_t g_fixed_slot_plus_one[RULOS_DMA_REQ_COUNT_] = {
#if defined(RULOS_ARM_stm32f0)
    [RULOS_DMA_REQ_USART1_TX] = 1 + 1,  // DMA1 Ch2 (conflicts with I2C1_TX/SPI1_RX)
    [RULOS_DMA_REQ_USART1_RX] = 2 + 1,  // DMA1 Ch3 (conflicts with I2C1_RX/SPI1_TX)
    [RULOS_DMA_REQ_I2C1_TX]   = 1 + 1,  // DMA1 Ch2 (conflicts with USART1_TX/SPI1_RX)
    [RULOS_DMA_REQ_I2C1_RX]   = 2 + 1,  // DMA1 Ch3 (conflicts with USART1_RX/SPI1_TX)
    [RULOS_DMA_REQ_SPI1_RX]   = 1 + 1,  // DMA1 Ch2 (conflicts with USART1_TX/I2C1_TX)
    [RULOS_DMA_REQ_SPI1_TX]   = 2 + 1,  // DMA1 Ch3 (conflicts with USART1_RX/I2C1_RX)
    [RULOS_DMA_REQ_SPI2_TX]   = 4 + 1,  // DMA1 Ch5
#elif defined(RULOS_ARM_stm32f1) || defined(RULOS_ARM_stm32f3)
    [RULOS_DMA_REQ_SPI1_RX]   = 1 + 1,  // DMA1 Ch2
    [RULOS_DMA_REQ_SPI1_TX]   = 2 + 1,  // DMA1 Ch3
    [RULOS_DMA_REQ_USART1_TX] = 3 + 1,  // DMA1 Ch4
    [RULOS_DMA_REQ_USART1_RX] = 4 + 1,  // DMA1 Ch5 (conflicts with SPI2_TX)
    [RULOS_DMA_REQ_I2C1_TX]   = 5 + 1,  // DMA1 Ch6
    [RULOS_DMA_REQ_I2C1_RX]   = 6 + 1,  // DMA1 Ch7
    [RULOS_DMA_REQ_SPI2_TX]   = 4 + 1,  // DMA1 Ch5 (conflicts with USART1_RX)
#endif
};
#endif  // !RULOS_DMA_HAS_DMAMUX

/*
 * RULOS request enum -> G4 DMAMUX request code. Designated initializers
 * leave unused slots at 0 (= LL_DMAMUX_REQ_MEM2MEM, safe sentinel).
 */
#if RULOS_DMA_HAS_DMAMUX
// Every peripheral request entry is individually guarded because small
// G0 variants (G030/G031) lack USART3+, TIM2 DMA, SPI2 DMA, etc. The
// allocator checks for a zero entry and fails alloc if a driver asks
// for a request the chip doesn't have.
static const uint32_t g_dmamux_req[RULOS_DMA_REQ_COUNT_] = {
#ifdef LL_DMAMUX_REQ_USART1_TX
    [RULOS_DMA_REQ_USART1_TX] = LL_DMAMUX_REQ_USART1_TX,
    [RULOS_DMA_REQ_USART1_RX] = LL_DMAMUX_REQ_USART1_RX,
#endif
#ifdef LL_DMAMUX_REQ_USART2_TX
    [RULOS_DMA_REQ_USART2_TX] = LL_DMAMUX_REQ_USART2_TX,
    [RULOS_DMA_REQ_USART2_RX] = LL_DMAMUX_REQ_USART2_RX,
#endif
#ifdef LL_DMAMUX_REQ_USART3_TX
    [RULOS_DMA_REQ_USART3_TX] = LL_DMAMUX_REQ_USART3_TX,
    [RULOS_DMA_REQ_USART3_RX] = LL_DMAMUX_REQ_USART3_RX,
#endif
// G4 calls these UART4/UART5; G0 calls them USART4..USART6. The two
// naming conventions never coexist on the same chip, so the #ifdef
// guards pick exactly one branch per family.
#ifdef LL_DMAMUX_REQ_UART4_TX
    [RULOS_DMA_REQ_USART4_TX] = LL_DMAMUX_REQ_UART4_TX,
    [RULOS_DMA_REQ_USART4_RX] = LL_DMAMUX_REQ_UART4_RX,
#endif
#ifdef LL_DMAMUX_REQ_UART5_TX
    [RULOS_DMA_REQ_USART5_TX] = LL_DMAMUX_REQ_UART5_TX,
    [RULOS_DMA_REQ_USART5_RX] = LL_DMAMUX_REQ_UART5_RX,
#endif
#ifdef LL_DMAMUX_REQ_USART4_TX
    [RULOS_DMA_REQ_USART4_TX] = LL_DMAMUX_REQ_USART4_TX,
    [RULOS_DMA_REQ_USART4_RX] = LL_DMAMUX_REQ_USART4_RX,
#endif
#ifdef LL_DMAMUX_REQ_USART5_TX
    [RULOS_DMA_REQ_USART5_TX] = LL_DMAMUX_REQ_USART5_TX,
    [RULOS_DMA_REQ_USART5_RX] = LL_DMAMUX_REQ_USART5_RX,
#endif
#ifdef LL_DMAMUX_REQ_USART6_TX
    [RULOS_DMA_REQ_USART6_TX] = LL_DMAMUX_REQ_USART6_TX,
    [RULOS_DMA_REQ_USART6_RX] = LL_DMAMUX_REQ_USART6_RX,
#endif
#ifdef LL_DMAMUX_REQ_I2C1_TX
    [RULOS_DMA_REQ_I2C1_TX] = LL_DMAMUX_REQ_I2C1_TX,
    [RULOS_DMA_REQ_I2C1_RX] = LL_DMAMUX_REQ_I2C1_RX,
#endif
#ifdef LL_DMAMUX_REQ_SPI1_TX
    [RULOS_DMA_REQ_SPI1_TX] = LL_DMAMUX_REQ_SPI1_TX,
    [RULOS_DMA_REQ_SPI1_RX] = LL_DMAMUX_REQ_SPI1_RX,
#endif
#ifdef LL_DMAMUX_REQ_SPI2_TX
    [RULOS_DMA_REQ_SPI2_TX] = LL_DMAMUX_REQ_SPI2_TX,
#endif
#ifdef LL_DMAMUX_REQ_TIM2_CH1
    [RULOS_DMA_REQ_TIM2_CH1] = LL_DMAMUX_REQ_TIM2_CH1,
    [RULOS_DMA_REQ_TIM2_CH2] = LL_DMAMUX_REQ_TIM2_CH2,
#endif
};
#endif  // RULOS_DMA_HAS_DMAMUX

// ----------------------------------------------------------------------------
// Private channel-indexed flag dispatch helpers.
//
// The classic-DMA LL headers (stm32fNxx_ll_dma.h, stm32gNxx_ll_dma.h)
// only expose per-channel flag helpers as
// LL_DMA_IsActiveFlag_TCn(DMAx) / LL_DMA_ClearFlag_TCn(DMAx) where
// the channel number N is part of the function name. Our dispatcher
// needs to index into the flag helpers by a runtime LL_DMA_CHANNEL_*
// value, so we wrap them in switch-based helpers once per file.
// ----------------------------------------------------------------------------

CCMRAM static bool ll_dma_is_active_flag_tc(DMA_TypeDef *dma, uint32_t ch) {
  switch (ch) {
    case LL_DMA_CHANNEL_1:
      return LL_DMA_IsActiveFlag_TC1(dma);
    case LL_DMA_CHANNEL_2:
      return LL_DMA_IsActiveFlag_TC2(dma);
    case LL_DMA_CHANNEL_3:
      return LL_DMA_IsActiveFlag_TC3(dma);
#ifdef LL_DMA_CHANNEL_4
    case LL_DMA_CHANNEL_4:
      return LL_DMA_IsActiveFlag_TC4(dma);
#endif
#ifdef LL_DMA_CHANNEL_5
    case LL_DMA_CHANNEL_5:
      return LL_DMA_IsActiveFlag_TC5(dma);
#endif
#ifdef LL_DMA_CHANNEL_6
    case LL_DMA_CHANNEL_6:
      return LL_DMA_IsActiveFlag_TC6(dma);
#endif
#ifdef LL_DMA_CHANNEL_7
    case LL_DMA_CHANNEL_7:
      return LL_DMA_IsActiveFlag_TC7(dma);
#endif
#ifdef LL_DMA_CHANNEL_8
    case LL_DMA_CHANNEL_8:
      return LL_DMA_IsActiveFlag_TC8(dma);
#endif
  }
  return false;
}

CCMRAM static void ll_dma_clear_flag_tc(DMA_TypeDef *dma, uint32_t ch) {
  switch (ch) {
    case LL_DMA_CHANNEL_1:
      LL_DMA_ClearFlag_TC1(dma);
      break;
    case LL_DMA_CHANNEL_2:
      LL_DMA_ClearFlag_TC2(dma);
      break;
    case LL_DMA_CHANNEL_3:
      LL_DMA_ClearFlag_TC3(dma);
      break;
#ifdef LL_DMA_CHANNEL_4
    case LL_DMA_CHANNEL_4:
      LL_DMA_ClearFlag_TC4(dma);
      break;
#endif
#ifdef LL_DMA_CHANNEL_5
    case LL_DMA_CHANNEL_5:
      LL_DMA_ClearFlag_TC5(dma);
      break;
#endif
#ifdef LL_DMA_CHANNEL_6
    case LL_DMA_CHANNEL_6:
      LL_DMA_ClearFlag_TC6(dma);
      break;
#endif
#ifdef LL_DMA_CHANNEL_7
    case LL_DMA_CHANNEL_7:
      LL_DMA_ClearFlag_TC7(dma);
      break;
#endif
#ifdef LL_DMA_CHANNEL_8
    case LL_DMA_CHANNEL_8:
      LL_DMA_ClearFlag_TC8(dma);
      break;
#endif
  }
}

CCMRAM static bool ll_dma_is_active_flag_ht(DMA_TypeDef *dma, uint32_t ch) {
  switch (ch) {
    case LL_DMA_CHANNEL_1:
      return LL_DMA_IsActiveFlag_HT1(dma);
    case LL_DMA_CHANNEL_2:
      return LL_DMA_IsActiveFlag_HT2(dma);
    case LL_DMA_CHANNEL_3:
      return LL_DMA_IsActiveFlag_HT3(dma);
#ifdef LL_DMA_CHANNEL_4
    case LL_DMA_CHANNEL_4:
      return LL_DMA_IsActiveFlag_HT4(dma);
#endif
#ifdef LL_DMA_CHANNEL_5
    case LL_DMA_CHANNEL_5:
      return LL_DMA_IsActiveFlag_HT5(dma);
#endif
#ifdef LL_DMA_CHANNEL_6
    case LL_DMA_CHANNEL_6:
      return LL_DMA_IsActiveFlag_HT6(dma);
#endif
#ifdef LL_DMA_CHANNEL_7
    case LL_DMA_CHANNEL_7:
      return LL_DMA_IsActiveFlag_HT7(dma);
#endif
#ifdef LL_DMA_CHANNEL_8
    case LL_DMA_CHANNEL_8:
      return LL_DMA_IsActiveFlag_HT8(dma);
#endif
  }
  return false;
}

