jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
// DMA1 Channels 2 and 3 share one interrupt line.
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}

#if defined(STM32G0B1xx)
// DMA1 Ch4-7 and DMA2 Ch1-5 share a single interrupt, along with
// DMAMUX1 overrun. We ignore DMAMUX overrun entirely -- the dispatch
// loop just checks every possible channel.
void DMA1_Ch4_7_DMA2_Ch1_5_DMAMUX1_OVR_IRQHandler(void) {
  dispatch_channel_irq(3);   // DMA1 Channel 4
  dispatch_channel_irq(4);   // DMA1 Channel 5
  dispatch_channel_irq(5);   // DMA1 Channel 6
  dispatch_channel_irq(6);   // DMA1 Channel 7
  dispatch_channel_irq(8);   // DMA2 Channel 1
  dispatch_channel_irq(9);   // DMA2 Channel 2
  dispatch_channel_irq(10);  // DMA2 Channel 3
  dispatch_channel_irq(11);  // DMA2 Channel 4
  dispatch_channel_irq(12);  // DMA2 Channel 5
}
#else
// Smaller G0 variants (G030/G031) have only 5 DMA1 channels and no
// DMA2. The merged handler name differs accordingly.
void DMA1_Ch4_5_DMAMUX1_OVR_IRQHandler(void) {
  dispatch_channel_irq(3);  // DMA1 Channel 4
  dispatch_channel_irq(4);  // DMA1 Channel 5
}
#endif  // STM32G0B1xx

#elif defined(RULOS_ARM_stm32c0)

// C0 has 3 DMA channels. Ch1 is standalone, Ch2-3 share a line.
// The DMAMUX1 overrun IRQ is separate (and unused -- we don't enable
// DMAMUX sync-overrun interrupts anywhere, so that vector stays
// at the default weak handler).
void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}

#else  // F0

// F0 has the same three-handler layout as G0 but different names
// (no DMAMUX, so no DMAMUX1_OVR suffix).
void DMA1_Channel1_IRQHandler(void) {
  dispatch_channel_irq(0);
}
void DMA1_Channel2_3_IRQHandler(void) {
  dispatch_channel_irq(1);  // DMA1 Channel 2
  dispatch_channel_irq(2);  // DMA1 Channel 3
}
void DMA1_Channel4_5_IRQHandler(void) {
  dispatch_channel_irq(3);  // DMA1 Channel 4
  dispatch_channel_irq(4);  // DMA1 Channel 5
}

#endif  // per-chip IRQ handlers

// ============================================================================
// STM32H5 GPDMA backend.
//
// GPDMA is a completely different controller from classic DMA:
// linked-list descriptors, per-channel built-in request mux (no
// separate DMAMUX peripheral), and separate CTR1/CTR2/CBR1/CSAR/
// CDAR registers instead of a packed CCR. The programming model is
// different enough that sharing code with the classic-DMA backend
// above isn't worth the conditional noise -- this block is its own
// self-contained backend.
//
// Scope: the pieces uart.c / twi.c / i2s.c / fatfs need for simple
// one-shot transfers:
//   - NORMAL mode only. CIRCULAR on GPDMA requires linked-list
//     descriptors which aren't implemented yet. init_channel traps
//     loudly if a caller asks for CIRCULAR.
//   - Per-channel dedicated IRQs (H523 has 16 of them: GPDMA1
//     Channel0-7 and GPDMA2 Channel0-7).
//   - TC / DTE (Data Transfer Error) callbacks. HT is wired into the
//     dispatcher but only fires in CIRCULAR mode, so it's currently
//     unused.
//
// Based on the NUCLEO-H533RE USART_Communication_TxRx_DMA example in
// ext/stm32/STM32CubeH5/Projects/NUCLEO-H533RE/Examples_LL/USART/.
// ============================================================================
#elif defined(RULOS_ARM_stm32h5)

typedef struct {
  DMA_TypeDef *dma;              // GPDMA1 or GPDMA2
  DMA_Channel_TypeDef *hw_ch;    // GPDMA1_Channel0, ...
  uint32_t ll_channel;           // LL_DMA_CHANNEL_0..7
  IRQn_Type irqn;
} dma_channel_hw_t;

#define DMA_CHANNEL_SLOTS 16  // GPDMA1 ch0-7 + GPDMA2 ch0-7

static const dma_channel_hw_t g_hw[DMA_CHANNEL_SLOTS] = {
    [0]  = {GPDMA1, GPDMA1_Channel0, LL_DMA_CHANNEL_0, GPDMA1_Channel0_IRQn},
    [1]  = {GPDMA1, GPDMA1_Channel1, LL_DMA_CHANNEL_1, GPDMA1_Channel1_IRQn},
    [2]  = {GPDMA1, GPDMA1_Channel2, LL_DMA_CHANNEL_2, GPDMA1_Channel2_IRQn},
    [3]  = {GPDMA1, GPDMA1_Channel3, LL_DMA_CHANNEL_3, GPDMA1_Channel3_IRQn},
    [4]  = {GPDMA1, GPDMA1_Channel4, LL_DMA_CHANNEL_4, GPDMA1_Channel4_IRQn},
    [5]  = {GPDMA1, GPDMA1_Channel5, LL_DMA_CHANNEL_5, GPDMA1_Channel5_IRQn},
    [6]  = {GPDMA1, GPDMA1_Channel6, LL_DMA_CHANNEL_6, GPDMA1_Channel6_IRQn},
    [7]  = {GPDMA1, GPDMA1_Channel7, LL_DMA_CHANNEL_7, GPDMA1_Channel7_IRQn},
#ifdef GPDMA2_Channel0_BASE_NS
    [8]  = {GPDMA2, GPDMA2_Channel0, LL_DMA_CHANNEL_0, GPDMA2_Channel0_IRQn},
    [9]  = {GPDMA2, GPDMA2_Channel1, LL_DMA_CHANNEL_1, GPDMA2_Channel1_IRQn},
    [10] = {GPDMA2, GPDMA2_Channel2, LL_DMA_CHANNEL_2, GPDMA2_Channel2_IRQn},
    [11] = {GPDMA2, GPDMA2_Channel3, LL_DMA_CHANNEL_3, GPDMA2_Channel3_IRQn},
    [12] = {GPDMA2, GPDMA2_Channel4, LL_DMA_CHANNEL_4, GPDMA2_Channel4_IRQn},
    [13] = {GPDMA2, GPDMA2_Channel5, LL_DMA_CHANNEL_5, GPDMA2_Channel5_IRQn},
    [14] = {GPDMA2, GPDMA2_Channel6, LL_DMA_CHANNEL_6, GPDMA2_Channel6_IRQn},
    [15] = {GPDMA2, GPDMA2_Channel7, LL_DMA_CHANNEL_7, GPDMA2_Channel7_IRQn},
#endif
};

typedef struct {
  bool allocated;
  bool circular;  // true if this channel uses linked-list circular mode
  void (*tc_callback)(void *user_data);
  void (*ht_callback)(void *user_data);
  void (*error_callback)(void *user_data);
  void *user_data;
  // Saved config for circular channels — needed by rulos_dma_start to
  // build the linked-list node (which requires direction, request,
  // widths, and increments that were specified at alloc time).
  rulos_dma_config_t saved_config;
  // Linked-list descriptor for circular mode. GPDMA reads this on
  // every wrap, so it must persist for the lifetime of the channel.
  LL_DMA_LinkNodeTypeDef lld_node;
} dma_channel_state_t;

static dma_channel_state_t g_state[DMA_CHANNEL_SLOTS];

static inline int state_to_idx(const rulos_dma_channel_t *ch) {
  return (const dma_channel_state_t *)ch - g_state;
}

// RULOS request -> GPDMA LL request code. On H5 the channel's request
// mux is built into CTR2 rather than a separate DMAMUX peripheral,
// but from the core layer's POV the translation is identical to the
// G0/G4 DMAMUX path: look up the vendor constant and program it into
// a channel register. Designated initializer leaves unused slots at
// 0, which is LL_GPDMA1_REQUEST_ADC1 -- not a valid sentinel in
// general but we bounds-check config->request against
// RULOS_DMA_REQ_COUNT_ in rulos_dma_alloc before indexing, so only
// entries explicitly assigned below are reachable at runtime.
//
// Add new entries as drivers get migrated. GPDMA1 and GPDMA2 share
// the same request codes on H523 (both see the same peripheral
// request lines); the channel number, not the GPDMA instance,
// determines which peripheral a transfer serves.
static const uint32_t g_gpdma_req[RULOS_DMA_REQ_COUNT_] = {
#ifdef LL_GPDMA1_REQUEST_USART1_TX
    [RULOS_DMA_REQ_USART1_TX] = LL_GPDMA1_REQUEST_USART1_TX,
    [RULOS_DMA_REQ_USART1_RX] = LL_GPDMA1_REQUEST_USART1_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_USART2_TX
    [RULOS_DMA_REQ_USART2_TX] = LL_GPDMA1_REQUEST_USART2_TX,
    [RULOS_DMA_REQ_USART2_RX] = LL_GPDMA1_REQUEST_USART2_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_USART3_TX
    [RULOS_DMA_REQ_USART3_TX] = LL_GPDMA1_REQUEST_USART3_TX,
    [RULOS_DMA_REQ_USART3_RX] = LL_GPDMA1_REQUEST_USART3_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_USART6_TX
    [RULOS_DMA_REQ_USART6_TX] = LL_GPDMA1_REQUEST_USART6_TX,
    [RULOS_DMA_REQ_USART6_RX] = LL_GPDMA1_REQUEST_USART6_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_I2C1_TX
    [RULOS_DMA_REQ_I2C1_TX] = LL_GPDMA1_REQUEST_I2C1_TX,
    [RULOS_DMA_REQ_I2C1_RX] = LL_GPDMA1_REQUEST_I2C1_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_SPI1_TX
    [RULOS_DMA_REQ_SPI1_TX] = LL_GPDMA1_REQUEST_SPI1_TX,
    [RULOS_DMA_REQ_SPI1_RX] = LL_GPDMA1_REQUEST_SPI1_RX,
#endif
#ifdef LL_GPDMA1_REQUEST_SPI2_TX
    [RULOS_DMA_REQ_SPI2_TX] = LL_GPDMA1_REQUEST_SPI2_TX,
#endif
};

// GPDMA has separate src/dest data-width fields (CTR1.SDW, CTR1.DDW)
// with distinct LL constant namespaces, so we need two small
// conversion helpers rather than one.
static uint32_t width_to_gpdma_src(rulos_dma_width_t w) {
  switch (w) {
    case RULOS_DMA_WIDTH_BYTE:     return LL_DMA_SRC_DATAWIDTH_BYTE;
    case RULOS_DMA_WIDTH_HALFWORD: return LL_DMA_SRC_DATAWIDTH_HALFWORD;
    case RULOS_DMA_WIDTH_WORD:     return LL_DMA_SRC_DATAWIDTH_WORD;
  }
  return LL_DMA_SRC_DATAWIDTH_BYTE;
}

static uint32_t width_to_gpdma_dest(rulos_dma_width_t w) {
  switch (w) {
    case RULOS_DMA_WIDTH_BYTE:     return LL_DMA_DEST_DATAWIDTH_BYTE;
    case RULOS_DMA_WIDTH_HALFWORD: return LL_DMA_DEST_DATAWIDTH_HALFWORD;
    case RULOS_DMA_WIDTH_WORD:     return LL_DMA_DEST_DATAWIDTH_WORD;
  }
  return LL_DMA_DEST_DATAWIDTH_BYTE;
}

// Map rulos_dma_config_t's mem/periph fields to GPDMA src/dest based
// on the transfer direction. Used by both init_channel (for NORMAL
// mode register writes) and setup_circular_node (for linked-list
// node creation). DRY: one place for the direction-dependent swap.
static void gpdma_get_src_dest_params(
    const rulos_dma_config_t *c,
    uint32_t *src_inc, uint32_t *dest_inc,
    uint32_t *src_width, uint32_t *dest_width) {
  if (c->direction == RULOS_DMA_DIR_MEM_TO_PERIPH) {
    *src_inc = c->mem_increment ? LL_DMA_SRC_INCREMENT : LL_DMA_SRC_FIXED;
    *dest_inc = c->periph_increment ? LL_DMA_DEST_INCREMENT : LL_DMA_DEST_FIXED;
    *src_width = width_to_gpdma_src(c->mem_width);
    *dest_width = width_to_gpdma_dest(c->periph_width);
  } else {
    *src_inc = c->periph_increment ? LL_DMA_SRC_INCREMENT : LL_DMA_SRC_FIXED;
    *dest_inc = c->mem_increment ? LL_DMA_DEST_INCREMENT : LL_DMA_DEST_FIXED;
    *src_width = width_to_gpdma_src(c->periph_width);
    *dest_width = width_to_gpdma_dest(c->mem_width);
  }
}

