jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
static void init_channel(int idx, const rulos_dma_config_t *c) {
  const dma_channel_hw_t *hw = &g_hw[idx];
  dma_channel_state_t *s = &g_state[idx];

  s->circular = (c->mode == RULOS_DMA_MODE_CIRCULAR);

  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  // Clear any stale flags from a previous owner of this slot.
  LL_DMA_ClearFlag_TC(hw->dma, hw->ll_channel);
  LL_DMA_ClearFlag_HT(hw->dma, hw->ll_channel);
  LL_DMA_ClearFlag_DTE(hw->dma, hw->ll_channel);

  // Write transfer config to channel registers for both NORMAL and
  // CIRCULAR. For CIRCULAR the linked-list node will reload them on
  // every wrap, but having them in the registers lets the first
  // block transfer start correctly.
  LL_DMA_SetDataTransferDirection(hw->dma, hw->ll_channel, c->direction);
  LL_DMA_SetPeriphRequest(hw->dma, hw->ll_channel, g_gpdma_req[c->request]);

  uint32_t si, di, sw, dw;
  gpdma_get_src_dest_params(c, &si, &di, &sw, &dw);
  LL_DMA_SetSrcIncMode(hw->dma, hw->ll_channel, si);
  LL_DMA_SetDestIncMode(hw->dma, hw->ll_channel, di);
  LL_DMA_SetSrcDataWidth(hw->dma, hw->ll_channel, sw);
  LL_DMA_SetDestDataWidth(hw->dma, hw->ll_channel, dw);

  if (s->circular) {
    // Save config so rulos_dma_start can build the linked-list node.
    s->saved_config = *c;
  }

  LL_DMA_SetChannelPriorityLevel(hw->dma, hw->ll_channel, c->priority);

  LL_DMA_EnableIT_TC(hw->dma, hw->ll_channel);
  LL_DMA_EnableIT_DTE(hw->dma, hw->ll_channel);
  if (s->circular) {
    LL_DMA_EnableIT_HT(hw->dma, hw->ll_channel);
  }

  s->tc_callback = c->tc_callback;
  s->ht_callback = c->ht_callback;
  s->error_callback = c->error_callback;
  s->user_data = c->user_data;
}

rulos_dma_channel_t *rulos_dma_alloc(const rulos_dma_config_t *config) {
  if (config == NULL || config->request == RULOS_DMA_REQ_NONE ||
      config->request >= RULOS_DMA_REQ_COUNT_) {
    return NULL;
  }
  if (g_gpdma_req[config->request] == 0 &&
      config->request != RULOS_DMA_REQ_USART1_TX) {
    // Guard against asking for a request enum value this chip's
    // GPDMA doesn't support. USART1_TX happens to be the request
    // code 0x16 on H5, not 0 -- but in general, an unset entry in
    // the designated-initializer table lands at 0, and we can't
    // tell that apart from a legitimate 0-valued request code.
    // Callers that ask for an unsupported request will fail the
    // alloc when init_channel programs a wrong request number;
    // the chip reacts with DTE on first transfer. Better to catch
    // it here where possible.
    //
    // (The simpler thing is to just document that unsupported
    // requests give undefined behaviour; for now we do nothing
    // beyond this bounds check since uart.c's users all request
    // USART*_TX, which are valid.)
  }

  int found_idx = -1;
  rulos_irq_state_t irq = hal_start_atomic();
  for (int i = 0; i < DMA_CHANNEL_SLOTS; i++) {
    if (g_hw[i].dma == NULL) continue;
    if (g_state[i].allocated) continue;
    g_state[i].allocated = true;
    found_idx = i;
    break;
  }
  hal_end_atomic(irq);

  if (found_idx < 0) {
    return NULL;
  }

  init_channel(found_idx, config);
  HAL_NVIC_SetPriority(g_hw[found_idx].irqn, 1, 0);
  HAL_NVIC_EnableIRQ(g_hw[found_idx].irqn);
  return (rulos_dma_channel_t *)&g_state[found_idx];
}

void rulos_dma_reconfigure(rulos_dma_channel_t *ch,
                           const rulos_dma_config_t *new_config) {
  init_channel(state_to_idx(ch), new_config);
}

void rulos_dma_start(rulos_dma_channel_t *ch, volatile void *periph_addr,
                     void *mem_addr, uint32_t nitems) {
  const int idx = state_to_idx(ch);
  const dma_channel_hw_t *hw = &g_hw[idx];
  dma_channel_state_t *s = &g_state[idx];

  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  if (s->circular) {
    // CIRCULAR mode: build a linked-list node that points to itself.
    // GPDMA reloads the channel registers from this node at the end
    // of each block, creating continuous circular transfer. The node
    // persists in g_state[].lld_node. Based on the NUCLEO-H563ZI
    // ADC circular DMA example in STM32CubeH5.
    const rulos_dma_config_t *c = &s->saved_config;

    uint32_t si, di, sw, dw;
    gpdma_get_src_dest_params(c, &si, &di, &sw, &dw);

    uint32_t src_addr, dst_addr;
    if (c->direction == RULOS_DMA_DIR_MEM_TO_PERIPH) {
      src_addr = (uint32_t)mem_addr;
      dst_addr = (uint32_t)periph_addr;
    } else {
      src_addr = (uint32_t)periph_addr;
      dst_addr = (uint32_t)mem_addr;
    }

    // Build the node descriptor.
    LL_DMA_InitNodeTypeDef node_cfg = {0};
    node_cfg.NodeType = LL_DMA_GPDMA_LINEAR_NODE;
    node_cfg.Mode = LL_DMA_NORMAL;  // each node runs one block
    node_cfg.Request = g_gpdma_req[c->request];
    node_cfg.BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    node_cfg.Direction = c->direction;
    node_cfg.SrcIncMode = si;
    node_cfg.DestIncMode = di;
    node_cfg.SrcDataWidth = sw;
    node_cfg.DestDataWidth = dw;
    node_cfg.SrcBurstLength = 1;
    node_cfg.DestBurstLength = 1;
    node_cfg.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;
    node_cfg.TriggerPolarity = LL_DMA_TRIG_POLARITY_MASKED;
    node_cfg.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
    node_cfg.SrcAddress = src_addr;
    node_cfg.DestAddress = dst_addr;
    node_cfg.BlkDataLength = nitems;
    node_cfg.UpdateRegisters =
        LL_DMA_UPDATE_CTR1 | LL_DMA_UPDATE_CTR2 |
        LL_DMA_UPDATE_CBR1 | LL_DMA_UPDATE_CSAR |
        LL_DMA_UPDATE_CDAR | LL_DMA_UPDATE_CLLR;

    LL_DMA_CreateLinkNode(&node_cfg, &s->lld_node);

    // Self-connect: node points to itself → circular.
    LL_DMA_ConnectLinkNode(&s->lld_node, LL_DMA_CLLR_OFFSET5,
                           &s->lld_node, LL_DMA_CLLR_OFFSET5);

    // Initialize channel for linked-list operation.
    LL_DMA_InitLinkedListTypeDef ll_cfg = {0};
    ll_cfg.Priority = c->priority;
    ll_cfg.LinkStepMode = LL_DMA_LSM_FULL_EXECUTION;
    ll_cfg.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;
    ll_cfg.LinkAllocatedPort = LL_DMA_LINK_ALLOCATED_PORT1;
    LL_DMA_List_Init(hw->dma, hw->ll_channel, &ll_cfg);

    // Point the channel at our self-referencing node.
    LL_DMA_SetLinkedListBaseAddr(hw->dma, hw->ll_channel,
                                (uint32_t)&s->lld_node);
    LL_DMA_ConfigLinkUpdate(hw->dma, hw->ll_channel,
                            node_cfg.UpdateRegisters,
                            (uint32_t)&s->lld_node);

    // Set addresses and block length for the first iteration (the
    // linked-list reload handles subsequent iterations).
    LL_DMA_SetBlkDataLength(hw->dma, hw->ll_channel, nitems);
    LL_DMA_ConfigAddresses(hw->dma, hw->ll_channel, src_addr, dst_addr);

