jelson/rulos/src/lib/chip/arm/stm32/core/dma.c
    LL_DMA_EnableChannel(hw->dma, hw->ll_channel);
  } else {
    // NORMAL mode: direct register programming.
    LL_DMA_SetBlkDataLength(hw->dma, hw->ll_channel, nitems);

    const uint32_t dir =
        LL_DMA_GetDataTransferDirection(hw->dma, hw->ll_channel);
    if (dir == LL_DMA_DIRECTION_MEMORY_TO_PERIPH) {
      LL_DMA_ConfigAddresses(hw->dma, hw->ll_channel, (uint32_t)mem_addr,
                             (uint32_t)periph_addr);
    } else {
      LL_DMA_ConfigAddresses(hw->dma, hw->ll_channel, (uint32_t)periph_addr,
                             (uint32_t)mem_addr);
    }

    LL_DMA_EnableChannel(hw->dma, hw->ll_channel);
  }
}

void rulos_dma_stop(rulos_dma_channel_t *ch) {
  const dma_channel_hw_t *hw = &g_hw[state_to_idx(ch)];
  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  // Same flag-clearing semantics as classic rulos_dma_stop: after
  // stop returns, no callback from the halted transfer can fire.
  LL_DMA_ClearFlag_TC(hw->dma, hw->ll_channel);
  LL_DMA_ClearFlag_HT(hw->dma, hw->ll_channel);
  LL_DMA_ClearFlag_DTE(hw->dma, hw->ll_channel);
}

uint32_t rulos_dma_get_remaining(const rulos_dma_channel_t *ch) {
  const dma_channel_hw_t *hw = &g_hw[state_to_idx(ch)];
  return LL_DMA_GetBlkDataLength(hw->dma, hw->ll_channel);
}

void rulos_dma_free(rulos_dma_channel_t *ch) {
  const int idx = state_to_idx(ch);
  const dma_channel_hw_t *hw = &g_hw[idx];
  LL_DMA_DisableChannel(hw->dma, hw->ll_channel);

  // Silence this channel at the DMA-hardware level; all H5 GPDMA
  // channels have dedicated IRQs so strictly speaking we could
  // HAL_NVIC_DisableIRQ here, but the hardware IT-disable approach
  // matches the classic backend's pattern and keeps the door open
  // for any future shared-IRQ H5 variant.
  LL_DMA_DisableIT_TC(hw->dma, hw->ll_channel);
  LL_DMA_DisableIT_HT(hw->dma, hw->ll_channel);
  LL_DMA_DisableIT_DTE(hw->dma, hw->ll_channel);

  rulos_irq_state_t irq = hal_start_atomic();
  g_state[idx] = (dma_channel_state_t){0};
  hal_end_atomic(irq);
}

static void dispatch_channel_irq(int idx) {
  const dma_channel_hw_t *hw = &g_hw[idx];
  dma_channel_state_t *s = &g_state[idx];
  if (hw->dma == NULL || !s->allocated) {
    return;
  }

  if (LL_DMA_IsActiveFlag_TC(hw->dma, hw->ll_channel)) {
    LL_DMA_ClearFlag_TC(hw->dma, hw->ll_channel);
    if (s->tc_callback) {
      s->tc_callback(s->user_data);
    }
  }

  if (LL_DMA_IsActiveFlag_HT(hw->dma, hw->ll_channel)) {
    LL_DMA_ClearFlag_HT(hw->dma, hw->ll_channel);
    if (s->ht_callback) {
      s->ht_callback(s->user_data);
    }
  }

  if (LL_DMA_IsActiveFlag_DTE(hw->dma, hw->ll_channel)) {
    LL_DMA_ClearFlag_DTE(hw->dma, hw->ll_channel);
    if (s->error_callback) {
      s->error_callback(s->user_data);
    }
  }
}

// Per-channel IRQ handlers. H523 has 16 dedicated lines, so these
// are one-to-one -- no merged dispatching like the G0/F0 backends.
void GPDMA1_Channel0_IRQHandler(void) { dispatch_channel_irq(0); }
void GPDMA1_Channel1_IRQHandler(void) { dispatch_channel_irq(1); }
void GPDMA1_Channel2_IRQHandler(void) { dispatch_channel_irq(2); }
void GPDMA1_Channel3_IRQHandler(void) { dispatch_channel_irq(3); }
void GPDMA1_Channel4_IRQHandler(void) { dispatch_channel_irq(4); }
void GPDMA1_Channel5_IRQHandler(void) { dispatch_channel_irq(5); }
void GPDMA1_Channel6_IRQHandler(void) { dispatch_channel_irq(6); }
void GPDMA1_Channel7_IRQHandler(void) { dispatch_channel_irq(7); }
#ifdef GPDMA2_Channel0_BASE_NS
void GPDMA2_Channel0_IRQHandler(void) { dispatch_channel_irq(8); }
void GPDMA2_Channel1_IRQHandler(void) { dispatch_channel_irq(9); }
void GPDMA2_Channel2_IRQHandler(void) { dispatch_channel_irq(10); }
void GPDMA2_Channel3_IRQHandler(void) { dispatch_channel_irq(11); }
void GPDMA2_Channel4_IRQHandler(void) { dispatch_channel_irq(12); }
void GPDMA2_Channel5_IRQHandler(void) { dispatch_channel_irq(13); }
void GPDMA2_Channel6_IRQHandler(void) { dispatch_channel_irq(14); }
void GPDMA2_Channel7_IRQHandler(void) { dispatch_channel_irq(15); }
#endif

// ============================================================================
// Stub backend -- any remaining family without a real backend.
//
// rulos_dma_alloc returns NULL so callers that do the right thing
// (`if (ch == NULL) ...` or `assert(ch != NULL)`) fail loudly at
// init time instead of silently corrupting state. The other entry
// points __builtin_trap() because reaching them means a caller
// passed a bogus handle -- there's no defensible non-trapping
// behavior once you're down that path.
// ============================================================================
#else

rulos_dma_channel_t *rulos_dma_alloc(const rulos_dma_config_t *config) {
  (void)config;
  return NULL;
}

void rulos_dma_reconfigure(rulos_dma_channel_t *ch,
                           const rulos_dma_config_t *new_config) {
  (void)ch;
  (void)new_config;
  __builtin_trap();
}

void rulos_dma_start(rulos_dma_channel_t *ch, volatile void *periph_addr,
                     void *mem_addr, uint32_t nitems) {
  (void)ch;
  (void)periph_addr;
  (void)mem_addr;
  (void)nitems;
  __builtin_trap();
}

void rulos_dma_stop(rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
}

uint32_t rulos_dma_get_remaining(const rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
  return 0;
}

void rulos_dma_free(rulos_dma_channel_t *ch) {
  (void)ch;
  __builtin_trap();
}

#endif  // backend selection
